RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_ll_utils.c
/* Private macros ------------------------------------------------------------*/
/** @addtogroup UTILS_LL_Private_Macros
  * @{
  */
#define IS_LL_UTILS_SYSCLK_DIV(__VALUE__) (((__VALUE__) == LL_RCC_SYSCLK_DIV_1)      \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_2)   \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_4)   \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_8)   \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_16)  \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_64)  \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_128) \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_256) \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_512))

#define IS_LL_UTILS_APB1_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB1_DIV_1)    \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_16))

#define IS_LL_UTILS_APB2_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB2_DIV_1)    \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_16))

#define IS_LL_UTILS_APB3_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB3_DIV_1)    \
                                         || ((__VALUE__) == LL_RCC_APB3_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB3_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB3_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB3_DIV_16))

#define IS_LL_UTILS_PLLM_VALUE(__VALUE__) ((1U <= (__VALUE__)) && ((__VALUE__) <= 63U))

#define IS_LL_UTILS_PLLN_VALUE(__VALUE__) ((4U <= (__VALUE__)) && ((__VALUE__) <= 512U))

#define IS_LL_UTILS_PLLP_VALUE(__VALUE__) ((2U <= (__VALUE__)) && ((__VALUE__) <= 128U))

#define IS_LL_UTILS_FRACN_VALUE(__VALUE__) ((__VALUE__) <= 0x1FFFU)

#define IS_LL_UTILS_PLLVCO_INPUT(__VALUE__, __RANGE__)  ( \
                                                          (((__RANGE__) == LL_RCC_PLLINPUTRANGE_1_2)  && \
                                                           (UTILS_PLLVCO_INPUT_MIN1 <= (__VALUE__))   && \
                                                           ((__VALUE__) <= UTILS_PLLVCO_INPUT_MAX1))  || \
                                                          (((__RANGE__) == LL_RCC_PLLINPUTRANGE_2_4)  && \
                                                           (UTILS_PLLVCO_INPUT_MIN2 <= (__VALUE__))   && \
                                                           ((__VALUE__) <= UTILS_PLLVCO_INPUT_MAX2))  || \
                                                          (((__RANGE__) == LL_RCC_PLLINPUTRANGE_4_8)  && \
                                                           (UTILS_PLLVCO_INPUT_MIN3 <= (__VALUE__))   && \
                                                           ((__VALUE__) <= UTILS_PLLVCO_INPUT_MAX3))  || \
                                                          (((__RANGE__) == LL_RCC_PLLINPUTRANGE_8_16) && \
                                                           (UTILS_PLLVCO_INPUT_MIN4 <= (__VALUE__))   && \
                                                           ((__VALUE__) <= UTILS_PLLVCO_INPUT_MAX4)))

#define IS_LL_UTILS_PLLVCO_OUTPUT(__VALUE__, __RANGE__) ( \
                                                          (((__RANGE__) == LL_RCC_PLLVCORANGE_MEDIUM)       && \
                                                           (UTILS_PLLVCO_MEDIUM_OUTPUT_MIN <= (__VALUE__))  && \
                                                           ((__VALUE__) <= UTILS_PLLVCO_MEDIUM_OUTPUT_MAX)) || \
                                                          (((__RANGE__) == LL_RCC_PLLVCORANGE_WIDE)         && \
                                                           (UTILS_PLLVCO_WIDE_OUTPUT_MIN <= (__VALUE__))    && \
                                                           ((__VALUE__) <= UTILS_PLLVCO_WIDE_OUTPUT_MAX)))

#define IS_LL_UTILS_CHECK_VCO_RANGES(__RANGEIN__, __RANGEOUT__) ( \
                                                                  (((__RANGEIN__) == LL_RCC_PLLINPUTRANGE_1_2)   && \
                                                                   ((__RANGEOUT__) == LL_RCC_PLLVCORANGE_MEDIUM)) || \
                                                                  (((__RANGEIN__) != LL_RCC_PLLINPUTRANGE_1_2)   && \
                                                                   ((__RANGEOUT__) == LL_RCC_PLLVCORANGE_WIDE)))

#define IS_LL_UTILS_PLL_FREQUENCY(__VALUE__) ((LL_PWR_GetRegulVoltageScaling() == LL_PWR_REGU_VOLTAGE_SCALE0) ? \
                                              ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE0) : \
                                              (LL_PWR_GetRegulVoltageScaling() == LL_PWR_REGU_VOLTAGE_SCALE1) ? \
                                              ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE1) : \
                                              (LL_PWR_GetRegulVoltageScaling() == LL_PWR_REGU_VOLTAGE_SCALE2) ? \
                                              ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE2) : \
                                              ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE3))

#define IS_LL_UTILS_HSE_BYPASS(__STATE__) (((__STATE__) == LL_UTILS_HSEBYPASS_ON)         \
                                           || ((__STATE__) == LL_UTILS_HSEBYPASS_DIGITAL_ON) \
                                           || ((__STATE__) == LL_UTILS_HSEBYPASS_OFF))

